2016/assignment-14.org
# -*- fill-column: 80; org-confirm-babel-evaluate: nil -*-

#+TITLE:     Assignment 14, Linear Algebra 1
#+AUTHOR:    Oleg Sivokon
#+EMAIL:     olegsivokon@gmail.com
#+DATE:      <2016-05-20 Fri>
#+DESCRIPTION: Third asssignment in the course Linear Algebra 1
#+KEYWORDS: Assignment, Linear Algebra
#+LANGUAGE: en
#+LaTeX_CLASS: article
#+LATEX_HEADER: \usepackage[usenames,dvipsnames]{color}
#+LATEX_HEADER: \usepackage{a4wide}
#+LATEX_HEADER: \usepackage{commath}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{marginnote}
#+LATEX_HEADER: \usepackage{enumerate}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{breqn}
#+LATEX_HEADER: \usepackage{flexisym}
#+LATEX_HEADER: \usepackage{mathstyle}
#+LATEX_HEADER: \hypersetup{urlcolor=blue}
#+LATEX_HEADER: \hypersetup{colorlinks,urlcolor=blue}
#+LATEX_HEADER: \setlength{\parskip}{16pt plus 2pt minus 2pt}
#+LATEX_HEADER: \definecolor{codebg}{rgb}{0.96,0.99,0.8}
#+LATEX_HEADER: \DeclareMathOperator{\Sp}{Sp}
#+LATEX_HEADER: \DeclareMathOperator{\cis}{cis}

#+BEGIN_SRC emacs-lisp :exports none
  (setq org-latex-pdf-process
          '("latexmk -pdflatex='pdflatex -shell-escape -interaction nonstopmode' -pdf -f %f")
          ;; org-latex-listings t
          org-src-fontify-natively t
          ;; org-latex-custom-lang-environments '((maxima "maxima"))
          ;; org-listings-escape-inside '("(*@" . "@*)")
          ;; org-babel-latex-htlatex "htlatex"
          )

    (defmacro by-backend (&rest body)
      `(progn
         (cl-case org-export-current-backend ,@body)))
#+END_SRC

#+RESULTS:
: by-backend

#+BEGIN_LATEX
\definecolor{codebg}{rgb}{0.96,0.99,0.8}
\lstnewenvironment{maxima}{%
  \lstset{backgroundcolor=\color{codebg},
    frame=single,
    framerule=0pt,
    basicstyle=\ttfamily\scriptsize,
    columns=fixed}}{}
}
\makeatletter
\newcommand{\verbatimfont}[1]{\renewcommand{\verbatim@font}{\ttfamily#1}}
\makeatother
\verbatimfont{\small}%
\makeatletter
\renewcommand*\env@matrix[1][*\c@MaxMatrixCols c]{%
  \hskip -\arraycolsep
  \let\@ifnextchar\new@ifnextchar
  \array{#1}}
\makeatother
\clearpage
#+END_LATEX

* Problems

** Problem 1
   Given $f, g, h$ are functions from $\mathbb{R}$ to $\mathbb{R}$, check that
   all of them are linearly independent when:
   1. $f(x) = \sin x$, $g(x) = \cos x$, $h(x) = x \cos x$.
   2. $f(x) = x(x - 1)$, $g(x) = x(x - 2)$, $h(x) = (x - 1)(x - 2)$.
   3. $f(x) = \sin^2 x$, $g(x) = \cos^2 x$, $h(x) = 3$.

*** Answer 1
    Assuming interval is $(-\infty, \infty)$, using Wronskian determinant:
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        D = \left|
        \begin{array}{lll}
          \sin x  & \cos x  & x\cos x \\
          \cos x  & -\sin x & \cos x - x \sin x \\
          -\sin x & -\cos x & -\sin x - \sin x - x \cos x
        \end{array}
        \right| = \left|
        \begin{array}{lll}
          \sin x  & \cos x  & x\cos x \\
          \cos x  & -\sin x & \cos x - x \sin x \\
          0       & 0       & -2\sin x
        \end{array}
        \right| = \\
        -2\sin x \times \left|\begin{array}{lll}
          \sin x  & \cos x \\
          \cos x  & -\sin x 
        \end{array}
        \right| = -2 \sin x (-\sin^2 x - \cos^2 x) = 2 \sin x\;.
      \end{align*}
    #+END_SRC
    Since determinant depends on $x$, it is certanly not zero for all $x$, hence
    $f, g, h$ are linearly independent.

*** Answer 2
    Assuming interval is $(-\infty, \infty)$, using Wronskian determinant:
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        D = \left|
        \begin{array}{lll}
          x^2 - x & x^2 - 2x & x^2 - 3x - 3 \\
          2x - 1  & 2x - 2  & 2x - 3 \\
          2       & 2       & 2
        \end{array}
        \right| = \\
        2(x^2 - x)(2x - 2 - 2x + 3) - 4(x^2 - 2x)(2x - 1 - 2x - 2) - 2(x^2 - 3x - 3) = \\
        2x^2 - 2x - 4x^2 + 8x - 2x^2 + 6x + 6 = \\
        -4x^2 + 12x + 6\;.
      \end{align*}
    #+END_SRC
    Since determinant depends on $x$, it is certanly not zero for all $x$, hence
    $f, g, h$ are linearly independent.

*** Answer 3
    Assuming interval is $(-\infty, \infty)$, $a\sin^2(x) + b\cos^2(x) + 3c = 0$
    has a solution when $a = b = 1$ and $c = -\frac{1}{3}$.  Thus $f, g, h$ are
    linearly dependent.

** Problem 2
   Given the following subsets of $\mathbb{R}^4$:
   #+HEADER: :exports results
   #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
   #+BEGIN_SRC latex
     \begin{align*}
       U &= \{(x, y, z, t) \in \mathbb{R}^4 \;|\; x - y + z = 0 \land x - y - 2t = 0\} \\
       W &= \Sp\{(1,0,1,1), (0,1,0,-1), (1,0,1,0)\}
     \end{align*}
   #+END_SRC
   
   1. Prove that $U$ and $W$ are subspaces of $\mathbb{R}^4$.
   2. Find basis for $U$, $W$ and $U+W$.
   3. Find basis for $U \cap W$.
   4. Find subspace $T$ of $\mathbb{R}^4$ s.t. $U \oplus T = \mathbb{R}^4$.

*** Answer 4
    $W$ is a subspace of $\mathbb{R}^4$ immediately from definition of span.
    $U$ is a subspace because it can be represented by $\Sp\{(1,0,0,0),
    (1,1,-1,-2), (0,-1,1,2), (0,-\frac{1}{2},\frac{1}{2},1)\}$ by noting that $x
    = y - 2t$ and $z = 2t$, which is again, by definition, a subspace of
    $\mathbb{R}^4$.

*** Answer 5
    Span of $U$ is also its basis since all vectors in it are linearly
    independent.  Span of $W$ contains linearly dependent vectors, $t$ is a
    multiple of $z$ and both of them are multiples of linear combination of $x$
    and $y$, hence its basis has only two vectors, for example $\{(1,0,0,0),
    (0,1,-1,2)\}$.  We can find the basis of $U + W$ by adjoining both bases
    and performing Gaussian elimination:
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        \begin{bmatrix}
          1 & 0 & 1 & 1 \\
          0 & 1 & 0 & -1 \\ 
          1 & 0 & 1 & 0 \\
          1 & 0 & 0 & 0 \\
          0 & 1 & -1 & 2
        \end{bmatrix} \sim
        \begin{bmatrix}
          1 & 0 & 0 & 0 \\
          0 & 0 & 1 & 1 \\
          0 & 1 & 0 & -1 \\ 
          0 & 0 & 1 & 0 \\
          0 & 1 & -1 & 2
        \end{bmatrix} \sim
        \begin{bmatrix}
          1 & 0 & 0 & 0 \\
          0 & 1 & 0 & -1 \\ 
          0 & 0 & -1 & 3 \\
          0 & 0 & 1 & 0 \\
          0 & 0 & 1 & 1 \\
        \end{bmatrix} \sim
        \begin{bmatrix}
          1 & 0 & 0 & 0 \\
          0 & 1 & 0 & -1 \\ 
          0 & 0 & 1 & 0 \\
          0 & 0 & 0 & 3 \\
          0 & 0 & 0 & 1
        \end{bmatrix} \sim
        \begin{bmatrix}
          1 & 0 & 0 & 0 \\
          0 & 1 & 0 & -1 \\ 
          0 & 0 & 1 & 0 \\
          0 & 0 & 0 & 1 \\
          0 & 0 & 0 & 0
        \end{bmatrix}
      \end{align*}
    #+END_SRC
    Which is the standard basis for $\mathbb{R}^4$.

*** Answer 6
    A generic vector $\vec{v} \in U \cap W$ must be representable as $\vec{v} =
    a(1,0,1,1) + b(0,1,0,-1) + c(1,0,1,0)$ and $\vec{v} = d(1,0,0,0) +
    e(0,1,-1,2)$.  Equating both parts gives: $a(1,0,1,1) + b(0,1,0,-1) +
    c(1,0,1,0) - d(1,0,0,0) - e(0,1,-1,2) = 0$.  Solving for $(a, b, c, d, e)$
    will give us the kernel space of $U \cap W$
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        \begin{bmatrix}
          1 & 0  & 1 & -1 & 0 \\
          0 & 1  & 0 & 0  & -1 \\ 
          1 & 0  & 1 & 0  & 1 \\
          1 & -1 & 0 & 0  & -2 
        \end{bmatrix} \sim
        \begin{bmatrix}
          1 & 0  & 1  & -1 & 0 \\
          0 & 1  & 0  & 0  & -1 \\ 
          0 & 0  & 0  & 1  & 1 \\
          0 & -1 & -1 & 1  & -2 
        \end{bmatrix} \sim
        \begin{bmatrix}
          1 & 0 & 0  & 0 & -3 \\
          0 & 1 & 0  & 0  & -1 \\ 
          0 & 0 & -1 & 0  & -4 \\ 
          0 & 0 & 0  & 1  & 1
        \end{bmatrix}
      \end{align*}
    #+END_SRC
    Since the only column that doesn't have a pivot element is the last one, the
    basis contains just one vector.  That is any solution to $a(1,0,1,1) +
    b(0,1,0,-1) + c(1,0,1,0) - d(1,0,0,0) - e(0,1,-1,2) = 0$ will give us the
    basis of $U \cap W$.
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        3(1,0,1,1) + 1(0,1,0,-1) - 4(1,0,1,0) + 1(1,0,0,0) - 1(0,1,-1,2) = 0 \\
        \vec{v} = 3(1,0,1,1) + 1(0,1,0,-1) - 4(1,0,1,0) = \\
        (3,0,3,3) + (0,1,0,-1) - (4,0,4,0) = (3-4,1,3-4,3-1) = (-1,1,-1,2)
      \end{align*}
    #+END_SRC
    Hence, the basis of $U \cap W = \{(-1,1,-1,2)\}$.

