2016/assignment-14.tex
% Created 2016-05-24 Tue 17:45
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage[hidelinks]{hyperref}
\tolerance=1000
\usepackage[utf8]{inputenc}
\usepackage[usenames,dvipsnames]{color}
\usepackage{a4wide}
\usepackage{commath}
\usepackage{amsmath}
\usepackage{marginnote}
\usepackage{enumerate}
\usepackage{listings}
\usepackage{color}
\usepackage{breqn}
\usepackage{flexisym}
\usepackage{mathstyle}
\hypersetup{urlcolor=blue}
\hypersetup{colorlinks,urlcolor=blue}
\setlength{\parskip}{16pt plus 2pt minus 2pt}
\definecolor{codebg}{rgb}{0.96,0.99,0.8}
\DeclareMathOperator{\Sp}{Sp}
\DeclareMathOperator{\cis}{cis}
\author{Oleg Sivokon}
\date{\textit{<2016-05-20 Fri>}}
\title{Assignment 14, Linear Algebra 1}
\hypersetup{
  pdfkeywords={Assignment, Linear Algebra},
  pdfsubject={Third asssignment in the course Linear Algebra 1},
  pdfcreator={Emacs 25.1.50.2 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\definecolor{codebg}{rgb}{0.96,0.99,0.8}
\lstnewenvironment{maxima}{%
  \lstset{backgroundcolor=\color{codebg},
    frame=single,
    framerule=0pt,
    basicstyle=\ttfamily\scriptsize,
    columns=fixed}}{}
}
\makeatletter
\newcommand{\verbatimfont}[1]{\renewcommand{\verbatim@font}{\ttfamily#1}}
\makeatother
\verbatimfont{\small}%
\makeatletter
\renewcommand*\env@matrix[1][*\c@MaxMatrixCols c]{%
  \hskip -\arraycolsep
  \let\@ifnextchar\new@ifnextchar
  \array{#1}}
\makeatother
\clearpage

\section{Problems}
\label{sec-1}

\subsection{Problem 1}
\label{sec-1-1}
Given $f, g, h$ are functions from $\mathbb{R}$ to $\mathbb{R}$, check that
all of them are linearly independent when:
\begin{enumerate}
\item $f(x) = \sin x$, $g(x) = \cos x$, $h(x) = x \cos x$.
\item $f(x) = x(x - 1)$, $g(x) = x(x - 2)$, $h(x) = (x - 1)(x - 2)$.
\item $f(x) = \sin^2 x$, $g(x) = \cos^2 x$, $h(x) = 3$.
\end{enumerate}

\subsubsection{Answer 1}
\label{sec-1-1-1}
Assuming interval is $(-\infty, \infty)$, using Wronskian determinant:
\begin{align*}
  D = \left|
  \begin{array}{lll}
    \sin x  & \cos x  & x\cos x \\
    \cos x  & -\sin x & \cos x - x \sin x \\
    -\sin x & -\cos x & -\sin x - \sin x - x \cos x
  \end{array}
  \right| = \left|
  \begin{array}{lll}
    \sin x  & \cos x  & x\cos x \\
    \cos x  & -\sin x & \cos x - x \sin x \\
    0       & 0       & -2\sin x
  \end{array}
  \right| = \\
  -2\sin x \times \left|\begin{array}{lll}
    \sin x  & \cos x \\
    \cos x  & -\sin x 
  \end{array}
  \right| = -2 \sin x (-\sin^2 x - \cos^2 x) = 2 \sin x\;.
\end{align*}

Since determinant depends on $x$, it is certanly not zero for all $x$, hence
$f, g, h$ are linearly independent.

\subsubsection{Answer 2}
\label{sec-1-1-2}
Assuming interval is $(-\infty, \infty)$, using Wronskian determinant:
\begin{align*}
  D = \left|
  \begin{array}{lll}
    x^2 - x & x^2 - 2x & x^2 - 3x - 3 \\
    2x - 1  & 2x - 2  & 2x - 3 \\
    2       & 2       & 2
  \end{array}
  \right| = \\
  2(x^2 - x)(2x - 2 - 2x + 3) - 4(x^2 - 2x)(2x - 1 - 2x - 2) - 2(x^2 - 3x - 3) = \\
  2x^2 - 2x - 4x^2 + 8x - 2x^2 + 6x + 6 = \\
  -4x^2 + 12x + 6\;.
\end{align*}

Since determinant depends on $x$, it is certanly not zero for all $x$, hence
$f, g, h$ are linearly independent.

\subsubsection{Answer 3}
\label{sec-1-1-3}
Assuming interval is $(-\infty, \infty)$, $a\sin^2(x) + b\cos^2(x) + 3c = 0$
has a solution when $a = b = 1$ and $c = -\frac{1}{3}$.  Thus $f, g, h$ are
linearly dependent.

\subsection{Problem 2}
\label{sec-1-2}
Given the following subsets of $\mathbb{R}^4$:
\begin{align*}
  U &= \{(x, y, z, t) \in \mathbb{R}^4 \;|\; x - y + z = 0 \land x - y - 2t = 0\} \\
  W &= \Sp\{(1,0,1,1), (0,1,0,-1), (1,0,1,0)\}
\end{align*}


\begin{enumerate}
\item Prove that $U$ and $W$ are subspaces of $\mathbb{R}^4$.
\item Find basis for $U$, $W$ and $U+W$.
\item Find basis for $U \cap W$.
\item Find subspace $T$ of $\mathbb{R}^4$ s.t. $U \oplus T = \mathbb{R}^4$.
\end{enumerate}

\subsubsection{Answer 4}
\label{sec-1-2-1}
$W$ is a subspace of $\mathbb{R}^4$ immediately from definition of span.
$U$ is a subspace because it can be represented by $\Sp\{(1,0,0,0),
    (1,1,-1,-2), (0,-1,1,2), (0,-\frac{1}{2},\frac{1}{2},1)\}$ by noting that $x
    = y - 2t$ and $z = 2t$, which is again, by definition, a subspace of
$\mathbb{R}^4$.

\subsubsection{Answer 5}
\label{sec-1-2-2}
Span of $U$ is also its basis since all vectors in it are linearly
independent.  Span of $W$ contains linearly dependent vectors, $t$ is a
multiple of $z$ and both of them are multiples of linear combination of $x$
and $y$, hence its basis has only two vectors, for example $\{(1,0,0,0),
    (0,1,-1,2)\}$.  We can find the basis of $U + W$ by adjoining both bases
and performing Gaussian elimination:
\begin{align*}
  \begin{bmatrix}
    1 & 0 & 1 & 1 \\
    0 & 1 & 0 & -1 \\ 
    1 & 0 & 1 & 0 \\
    1 & 0 & 0 & 0 \\
    0 & 1 & -1 & 2
  \end{bmatrix} \sim
  \begin{bmatrix}
    1 & 0 & 0 & 0 \\
    0 & 0 & 1 & 1 \\
    0 & 1 & 0 & -1 \\ 
    0 & 0 & 1 & 0 \\
    0 & 1 & -1 & 2
  \end{bmatrix} \sim
  \begin{bmatrix}
    1 & 0 & 0 & 0 \\
    0 & 1 & 0 & -1 \\ 
    0 & 0 & -1 & 3 \\
    0 & 0 & 1 & 0 \\
    0 & 0 & 1 & 1 \\
  \end{bmatrix} \sim
  \begin{bmatrix}
    1 & 0 & 0 & 0 \\
    0 & 1 & 0 & -1 \\ 
    0 & 0 & 1 & 0 \\
    0 & 0 & 0 & 3 \\
    0 & 0 & 0 & 1
  \end{bmatrix} \sim
  \begin{bmatrix}
    1 & 0 & 0 & 0 \\
    0 & 1 & 0 & -1 \\ 
    0 & 0 & 1 & 0 \\
    0 & 0 & 0 & 1 \\
    0 & 0 & 0 & 0
  \end{bmatrix}
\end{align*}

Which is the standard basis for $\mathbb{R}^4$.

\subsubsection{Answer 6}
\label{sec-1-2-3}
A generic vector $\vec{v} \in U \cap W$ must be representable as $\vec{v} =
    a(1,0,1,1) + b(0,1,0,-1) + c(1,0,1,0)$ and $\vec{v} = d(1,0,0,0) +
    e(0,1,-1,2)$.  Equating both parts gives: $a(1,0,1,1) + b(0,1,0,-1) +
    c(1,0,1,0) - d(1,0,0,0) - e(0,1,-1,2) = 0$.  Solving for $(a, b, c, d, e)$
will give us the kernel space of $U \cap W$
\begin{align*}
  \begin{bmatrix}
    1 & 0  & 1 & -1 & 0 \\
    0 & 1  & 0 & 0  & -1 \\ 
    1 & 0  & 1 & 0  & 1 \\
    1 & -1 & 0 & 0  & -2 
  \end{bmatrix} \sim
  \begin{bmatrix}
    1 & 0  & 1  & -1 & 0 \\
    0 & 1  & 0  & 0  & -1 \\ 
    0 & 0  & 0  & 1  & 1 \\
    0 & -1 & -1 & 1  & -2 
  \end{bmatrix} \sim
  \begin{bmatrix}
    1 & 0 & 0  & 0 & -3 \\
    0 & 1 & 0  & 0  & -1 \\ 
    0 & 0 & -1 & 0  & -4 \\ 
    0 & 0 & 0  & 1  & 1
  \end{bmatrix}
\end{align*}

Since the only column that doesn't have a pivot element is the last one, the
basis contains just one vector.  That is any solution to $a(1,0,1,1) +
    b(0,1,0,-1) + c(1,0,1,0) - d(1,0,0,0) - e(0,1,-1,2) = 0$ will give us the
basis of $U \cap W$.
\begin{align*}
  3(1,0,1,1) + 1(0,1,0,-1) - 4(1,0,1,0) + 1(1,0,0,0) - 1(0,1,-1,2) = 0 \\
  \vec{v} = 3(1,0,1,1) + 1(0,1,0,-1) - 4(1,0,1,0) = \\
  (3,0,3,3) + (0,1,0,-1) - (4,0,4,0) = (3-4,1,3-4,3-1) = (-1,1,-1,2)
\end{align*}

Hence, the basis of $U \cap W = \{(-1,1,-1,2)\}$.
