2016/assignment-14.org
*** Answer 7
    One way to find such subspace of $\mathbb{R}^4$ we can simply complete the
    two vectors of the basis of $U$ with two vectors from the standard basis to
    form an invertible matrix like so:
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        \begin{bmatrix}
          1 & 0 & 0 & 0 \\
          0 & 1 & -1 & 2 \\ 
          0 & 0 & 1 & 0 \\
          0 & 0 & 0 & 1 
        \end{bmatrix}
      \end{align*}
    #+END_SRC
    This is an upper-triangular matrix, therefor invertible, therefore its row
    space spans $\mathbb{R}^4$.  Thus $U \oplus \{(0,0,1,0),(0,0,0,1)\} =
    \mathbb{R}^4$.

** Problem 3
   Let $\vec{v}_1, \vec{v}_2, \dots, \vec{v}_k$ and $\vec{w}$ be vectors in
   linear space $V$.  Given $\{\vec{v}_1, \vec{v}_2, \dots, \vec{v}_k\}$ is
   linearly independent and that $\vec{w} \not \in \Sp\{\vec{v}_1, \vec{v}_2,
   \dots, \vec{v}_k\}$, prove that $\vec{v_1} \not \in \Sp\{\vec{v}_1 + \vec{w},
   \vec{v}_2 + \vec{w}, \dots, \vec{v}_k + \vec{w}\}$.

*** Answer 8
    Suppose, for contradiction, $\vec{v}_1 = a(\vec{v}_1 + \vec{w}) +
   b(\vec{v}_2 + \vec{w}) + \dots + c(\vec{v}_k + \vec{w})$ for some constants
   $a, b \dots c$.  Then we have $(1 - a)\vec{v}_1 - b\vec{v}_2 - \dots -
   c\vec{v}_k = -(a + b + \dots + c)\vec{w}$.  Notice that this says that
   $\vec{w}$ is a linear combination of $\{\vec{v}_1, \vec{v}_2, \dots,
   \vec{v}_k\}$, which is a contradiction to the given.  Hence, $\vec{v}_1 \not
   \in \Sp\{\vec{v}_1 + \vec{w}, \vec{v}_2 + \vec{w}, \dots, \vec{v}_k +
   \vec{w}\}$.

** Problem 4
   Let $U$ and $W$ be distinct linear subspaces of $\mathbb{R}^4$ of
   dimension 3.  Suppose $(2, 1, 0, 1), (1, 0, 1, 1) \in U \cap W$, what is the
   dimension of $U + W$?

*** Answer 9
    Spans of both $U$ and $W$ have a vector that the other doesn't have
    (otherwise they would be the same subspace).  Since the span of their
    intersection has two distinct vectors, it means that their sum must contain
    all linear combinations of the vectors in the span of intersection and the
    remaining distinct vector.  This leaves us the only option of $\dim(U+W) =
    4$.

** Problem 5
   Let $A$ and $B$ be square matrices of size $n$, $n \geq 2$.  Suppose $A$ and
   $B$ are of rank 1, 
   1. what are the possible ranks of $A + B$?
   2. What is the possible rank of $A + B$ when they both are of rank 2?
   3. Prove that it is possible to write any matrix of rank 2 as a sum of
      two matrices of rank 1.

*** Answer 10
    It can be either zero, one or two.
    1. It can be zero when $A = -B$.  Since this is the zero matrix, its rank is 0.
    2. It can be one when, for example, $A = B$, since it would imply $A + B =
       2A$ and rank is preserved under scalar multiplication.
    3. For matrix to have rank equal to one it means that all of its non-zero
       values are concentrated in either the same row, or the same column.
       Whenever a matrix has two or more rows (or columns), where one of the
       rows (or columns) is the zero vector, it is possible to find another
       matrix, which has in the corresponding position its non-zero entries.
       Thus, the rank can be also 2, but no more than that, since another matrix
       will necessarily have at most one non-zero row.

*** Answer 11
    Similarly, for matrices of rank 2, we can have rank at leas 0 or at most 4,
    or anything in between.
    1. Zeroth rank will result from adding $A$ and $B$ s.t. $A = -B$.
    2. Rank of one will result from matrices s.t. the entries of $A$ are
       $a_{i,j}$, the entries of $B$ are $b_{i,j}$ and $\forall (0 \geq i \geq n,
       0 \geq j \geq n): a_{i, j} = -b_{i, j}$, unless $i = k$ and $j = m$ (some
       constants).  In other words, when all but one entries in these two
       matrices are additive inverses of each other except for one entry.
    3. The rank will be two when, for example, $A = B$ for the same reason as
       above.
    4. Example of rank three sum:
       #+HEADER: :exports results
       #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
       #+BEGIN_SRC latex
         \begin{align*}
           \begin{bmatrix}
             1 & 0 & 0 \\
             0 & 1 & 0 \\
             0 & 0 & 0
           \end{bmatrix} +
           \begin{bmatrix}
             0 & 0 & 0 \\
             0 & 1 & 0 \\
             0 & 0 & 1
           \end{bmatrix} = 
           \begin{bmatrix}
             1 & 0 & 0 \\
             0 & 1 & 0 \\
             0 & 0 & 1
           \end{bmatrix}
         \end{align*}
       #+END_SRC
    5. Rank can similarly be four:
       #+HEADER: :exports results
       #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
       #+BEGIN_SRC latex
         \begin{align*}
           \begin{bmatrix}
             1 & 0 & 0 & 0 \\
             0 & 1 & 0 & 0 \\
             0 & 0 & 0 & 0 \\
             0 & 0 & 0 & 0
           \end{bmatrix} +
           \begin{bmatrix}
             0 & 0 & 0 & 0 \\
             0 & 0 & 0 & 0 \\
             0 & 0 & 1 & 0 \\
             0 & 0 & 0 & 1
           \end{bmatrix} = 
           \begin{bmatrix}
             1 & 0 & 0 & 0 \\
             0 & 1 & 0 & 0 \\
             0 & 0 & 1 & 0 \\
             0 & 0 & 0 & 1
           \end{bmatrix}
         \end{align*}
       #+END_SRC
       But it cannot be more than four since both $A$ and $B$ will have at most
       two non-zero rows (or columns), which is only enough to produce four
       pivot elements in the total.  Since rank is equal to the dimension of
       column (or row) span of the matrix, and the dimesnion of these spaces is
       determined by the number of pivots, it is thus impossible to have rank
       higher than four when adding $A$ and $B$.

*** Answer 12
    Let $C$ be arbitrary matrix of rank 2.  Since rank is preserved under
    multiplication with fully-ranked matrix, we can perform Gaussian elimination
    on $C$ to obtain a general-form matrix $C'$ lookin like this:
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        C' &= \begin{bmatrix}
          1      & \dots  & \dots \\
          0      & 1      & \dots \\
          \vdots & \vdots & \ddots
        \end{bmatrix}
      \end{align*}
    #+END_SRC
    Which, clearly, can be decomposed into two matrices of rank 1.  From
    distributivity of matrix multiplication over addition we can show that by
    multiplying by elementary matrices we can restore the obtained sum to match
    $C$ (the original matrix).  In other words: $C \times c_1E \times c_2E
    \times \dots \times c_nE = C'$, where $Es$ are some elementary matrices and
    $c_i$ are some constants, hence $(A + B) \times c_1E \times c_2E \times
    \dots \times c_nE = C$, provided $A + B = C'$.

** Problem 6
   Given bases $B = (\vec{u}_1, \vec{u}_2, \vec{u}_3)$ and $C = (\vec{v}_1,
   \vec{v}_2, \vec{v}_3)$ both in $\mathbb{R}^3$ s.t.
   #+HEADER: :exports results
   #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
   #+BEGIN_SRC latex
     \begin{align*}
       \vec{u}_1 &= (2,1,1) \\
       \vec{u}_2 &= (2,-1,1) \\
       \vec{u}_3 &= (1,2,1) \\
       \vec{v}_1 &= (3,1,-5) \\
       \vec{v}_2 &= (1,1,-3) \\
       \vec{v}_3 &= (-1,0,2)
     \end{align*}
   #+END_SRC
   1. Write the matrix of change of basis from $B$ to $C$ and its inverse.
   2. Compute the coordinate vector $[\vec{w}]_B$ where $\vec{w} = (-5,8,-5)$.
   3. Similarly, compute $[\vec{w}]_C$.

