2016/assignment-14.org
*** Answer 13
    The change of basis matrix from $B$ to $C$ can be found as follow:
    1. Undo the transformation from the standard basis to basis $B$ by
       multiplying the coordinates vector by $B^{-1}$.
    2. Multiply by $C$ to perform transformation.
    3. Multiply by $B$ to represent the resulting coordinates with respect to
       $B$.
       
    Or, in other words, $T_{B\to C} = C^{-1}BC$:
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        \begin{bmatrix}
          3  & 1  & -1 \\
          1  & 1  & 0 \\
          -5 & -3 & 2
        \end{bmatrix}^{-1} \times
        \begin{bmatrix}
          2 & 2  & 1 \\
          1 & -1 & 2 \\
          1 & 1  & 1
        \end{bmatrix} \times
        \begin{bmatrix}
          3  & 1  & -1 \\
          1  & 1  & 0 \\
          -5 & -3 & 2
        \end{bmatrix} = \\
        \begin{bmatrix}
          3  & 1  & -1 \\
          1  & 1  & 0 \\
          -5 & -3 & 2
        \end{bmatrix}^{-1} \times
        \begin{bmatrix}
          6 + 1 - 1 & 6 - 1 - 1 & 3 + 2 - 1 \\
          2 + 1 + 0 & 2 - 1 + 0 & 1 + 2 + 0 \\
          -10 - 3 + 2 & -10 + 3 + 2 & -5 - 6 + 3
        \end{bmatrix} = \\
        \begin{bmatrix}
          3  & 1  & -1 \\
          1  & 1  & 0 \\
          -5 & -3 & 2
        \end{bmatrix}^{-1} \times
        \begin{bmatrix}
          6 & 4 & 4 \\
          3 & 1 & 3 \\
          -11 & -5 & -8
        \end{bmatrix}
      \end{align*}
    #+END_SRC
    Now, let's find $C^{-1}$:
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        \begin{bmatrix}
          3  & 1  & -1 & 1 & 0 & 0 \\
          1  & 1  & 0  & 0 & 1 & 0 \\
          -5 & -3 & 2  & 0 & 0 & 1
        \end{bmatrix} \sim
        \begin{bmatrix}
          1 & 1  & 0  & 0 & 1  & 0 \\
          0 & -2 & -1 & 1 & -3 & 0 \\
          0 & 2  & 2  & 0 & 5  & 1
        \end{bmatrix} \sim \\
        \begin{bmatrix}
          1 & 1 & 0           & 0            & 1           & 0 \\
          0 & 1 & \frac{1}{2} & -\frac{1}{2} & \frac{3}{2} & 0 \\
          0 & 0 & 1           & 1            & 2           & 1
        \end{bmatrix} \sim 
        \begin{bmatrix}
          1 & 0 & 0 & 1  & -\frac{1}{2} & \frac{1}{2} \\
          0 & 1 & 0 & -1 & \frac{1}{2}  & -\frac{1}{2} \\
          0 & 0 & 1 & 1  & 2            & 1
        \end{bmatrix}
      \end{align*}
    #+END_SRC
    finally:
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        \begin{bmatrix}
          3  & 1  & -1 \\
          1  & 1  & 0 \\
          -5 & -3 & 2
        \end{bmatrix}^{-1} \times
        \begin{bmatrix}
          6   & 4  & 4 \\
          3   & 1  & 3 \\
          -11 & -5 & -8
        \end{bmatrix} = 
        \begin{bmatrix}
          1  & -\frac{1}{2} & \frac{1}{2} \\
          -1 & \frac{1}{2}  & -\frac{1}{2} \\
          1  & 2            & 1
        \end{bmatrix} \times
        \begin{bmatrix}
          6   & 4  & 4 \\
          3   & 1  & 3 \\
          -11 & -5 & -8
        \end{bmatrix} = \\
        \begin{bmatrix}
          6 - \frac{3}{2} - \frac{11}{2}  & 4 - \frac{1}{2} - \frac{5}{2}  & 4 - \frac{3}{2} - 4 \\
          -6 + \frac{3}{2} + \frac{11}{2} & -4 + \frac{1}{2} + \frac{5}{2} & -4 + \frac{3}{2} + 4 \\
          6 + 6 - 11                      & 4 + 2 - 5                      & 4 + 6 - 8
        \end{bmatrix} = 
        \begin{bmatrix}
          -1 & 1 & \frac{3}{2} \\
          1  & 1 & \frac{3}{2} \\
          1  & 1 & 2
        \end{bmatrix}
      \end{align*}
    #+END_SRC

*** Answer 14
    $[\vec{w}]_B$ is just $B^{-1}w$.  First, compute $B^{-1}$:
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        \begin{bmatrix}
          2 & 2  & 1 & 1 & 0 & 0 \\
          1 & -1 & 2 & 0 & 1 & 0 \\
          1 & 1  & 1 & 0 & 0 & 1
        \end{bmatrix} \sim
        \begin{bmatrix}
          1 & 1  & 1  & 0 & 0 & 1 \\
          0 & -2 & 1  & 0 & 1 & -1 \\
          0 & 0  & -1 & 1 & 0 & -2
        \end{bmatrix} \sim
        \begin{bmatrix}
          1 & 1 & 1            & 0  & 0            & 1 \\
          0 & 1 & -\frac{1}{2} & 0  & -\frac{1}{2} & \frac{1}{2} \\
          0 & 0 & 1            & -1 & 0            & 2
        \end{bmatrix} \sim \\
        \begin{bmatrix}
          1 & 1 & 0 & 1            & 0            & -1 \\
          0 & 1 & 0 & -\frac{1}{2} & -\frac{1}{2} & \frac{3}{2} \\
          0 & 0 & 1 & -1           & 0            & 2
        \end{bmatrix} \sim
        \begin{bmatrix}
          1 & 0 & 0 & \frac{3}{2}  & \frac{1}{2}  & -\frac{5}{2} \\
          0 & 1 & 0 & -\frac{1}{2} & -\frac{1}{2} & \frac{3}{2} \\
          0 & 0 & 1 & -1           & 0            & 2
        \end{bmatrix} \\
        \textit{Hence }B^{-1} = 
        \begin{bmatrix}
          \frac{3}{2}  & \frac{1}{2}  & -\frac{5}{2} \\
          -\frac{1}{2} & -\frac{1}{2} & \frac{3}{2} \\
          -1           & 0            & 2
        \end{bmatrix}
      \end{align*}
    #+END_SRC
    Thus, $[\vec{w}]_B$ can be computed via:
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        \begin{bmatrix}
          \frac{3}{2}  & \frac{1}{2}  & -\frac{5}{2} \\
          -\frac{1}{2} & -\frac{1}{2} & \frac{3}{2} \\
          -1           & 0            & 2
        \end{bmatrix} \times 
        \begin{bmatrix}
          -5 \\
          8 \\
          -5
        \end{bmatrix} =
        \begin{bmatrix}
          -\frac{15}{2} + 4 + \frac{25}{2} \\
          \frac{5}{2} - 4 - \frac{15}{2} \\
          5 - 10
        \end{bmatrix} = 
        \begin{bmatrix}
          9 \\
          1 \\
          -5
        \end{bmatrix}
      \end{align*}
    #+END_SRC

*** Answer 15
    Similarly, $[\vec{w}]_C$ is just $C^{-1}w$ (we've already computed $C^{-1}$
    in the previous answer.)
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        \begin{bmatrix}
          1  & -\frac{1}{2} & \frac{1}{2} \\
          -1 & \frac{1}{2}  & -\frac{1}{2} \\
          1  & 2            & 1
        \end{bmatrix} \times
        \begin{bmatrix}
          -5 \\
          8 \\
          -5
        \end{bmatrix} =
        \begin{bmatrix}
          -5 - 4 - \frac{5}{2} \\
          5  + 4 + \frac{5}{2} \\
          -5 + 16 - 5
        \end{bmatrix} =
        \begin{bmatrix}
          -\frac{23}{2} \\
          \frac{23}{2} \\
          6
        \end{bmatrix}
      \end{align*}
    #+END_SRC
