2016/assignment-14.tex

\subsubsection{Answer 13}
\label{sec-1-6-1}
The change of basis matrix from $B$ to $C$ can be found as follow:
\begin{enumerate}
\item Undo the transformation from the standard basis to basis $B$ by
multiplying the coordinates vector by $B^{-1}$.
\item Multiply by $C$ to perform transformation.
\item Multiply by $B$ to represent the resulting coordinates with respect to
$B$.
\end{enumerate}

Or, in other words, $T_{B\to C} = C^{-1}BC$:
\begin{align*}
  \begin{bmatrix}
    3  & 1  & -1 \\
    1  & 1  & 0 \\
    -5 & -3 & 2
  \end{bmatrix}^{-1} \times
  \begin{bmatrix}
    2 & 2  & 1 \\
    1 & -1 & 2 \\
    1 & 1  & 1
  \end{bmatrix} \times
  \begin{bmatrix}
    3  & 1  & -1 \\
    1  & 1  & 0 \\
    -5 & -3 & 2
  \end{bmatrix} = \\
  \begin{bmatrix}
    3  & 1  & -1 \\
    1  & 1  & 0 \\
    -5 & -3 & 2
  \end{bmatrix}^{-1} \times
  \begin{bmatrix}
    6 + 1 - 1 & 6 - 1 - 1 & 3 + 2 - 1 \\
    2 + 1 + 0 & 2 - 1 + 0 & 1 + 2 + 0 \\
    -10 - 3 + 2 & -10 + 3 + 2 & -5 - 6 + 3
  \end{bmatrix} = \\
  \begin{bmatrix}
    3  & 1  & -1 \\
    1  & 1  & 0 \\
    -5 & -3 & 2
  \end{bmatrix}^{-1} \times
  \begin{bmatrix}
    6 & 4 & 4 \\
    3 & 1 & 3 \\
    -11 & -5 & -8
  \end{bmatrix}
\end{align*}

Now, let's find $C^{-1}$:
\begin{align*}
  \begin{bmatrix}
    3  & 1  & -1 & 1 & 0 & 0 \\
    1  & 1  & 0  & 0 & 1 & 0 \\
    -5 & -3 & 2  & 0 & 0 & 1
  \end{bmatrix} \sim
  \begin{bmatrix}
    1 & 1  & 0  & 0 & 1  & 0 \\
    0 & -2 & -1 & 1 & -3 & 0 \\
    0 & 2  & 2  & 0 & 5  & 1
  \end{bmatrix} \sim \\
  \begin{bmatrix}
    1 & 1 & 0           & 0            & 1           & 0 \\
    0 & 1 & \frac{1}{2} & -\frac{1}{2} & \frac{3}{2} & 0 \\
    0 & 0 & 1           & 1            & 2           & 1
  \end{bmatrix} \sim 
  \begin{bmatrix}
    1 & 0 & 0 & 1  & -\frac{1}{2} & \frac{1}{2} \\
    0 & 1 & 0 & -1 & \frac{1}{2}  & -\frac{1}{2} \\
    0 & 0 & 1 & 1  & 2            & 1
  \end{bmatrix}
\end{align*}

finally:
\begin{align*}
  \begin{bmatrix}
    3  & 1  & -1 \\
    1  & 1  & 0 \\
    -5 & -3 & 2
  \end{bmatrix}^{-1} \times
  \begin{bmatrix}
    6   & 4  & 4 \\
    3   & 1  & 3 \\
    -11 & -5 & -8
  \end{bmatrix} = 
  \begin{bmatrix}
    1  & -\frac{1}{2} & \frac{1}{2} \\
    -1 & \frac{1}{2}  & -\frac{1}{2} \\
    1  & 2            & 1
  \end{bmatrix} \times
  \begin{bmatrix}
    6   & 4  & 4 \\
    3   & 1  & 3 \\
    -11 & -5 & -8
  \end{bmatrix} = \\
  \begin{bmatrix}
    6 - \frac{3}{2} - \frac{11}{2}  & 4 - \frac{1}{2} - \frac{5}{2}  & 4 - \frac{3}{2} - 4 \\
    -6 + \frac{3}{2} + \frac{11}{2} & -4 + \frac{1}{2} + \frac{5}{2} & -4 + \frac{3}{2} + 4 \\
    6 + 6 - 11                      & 4 + 2 - 5                      & 4 + 6 - 8
  \end{bmatrix} = 
  \begin{bmatrix}
    -1 & 1 & \frac{3}{2} \\
    1  & 1 & \frac{3}{2} \\
    1  & 1 & 2
  \end{bmatrix}
\end{align*}

\subsubsection{Answer 14}
\label{sec-1-6-2}
$[\vec{w}]_B$ is just $B^{-1}w$.  First, compute $B^{-1}$:
\begin{align*}
  \begin{bmatrix}
    2 & 2  & 1 & 1 & 0 & 0 \\
    1 & -1 & 2 & 0 & 1 & 0 \\
    1 & 1  & 1 & 0 & 0 & 1
  \end{bmatrix} \sim
  \begin{bmatrix}
    1 & 1  & 1  & 0 & 0 & 1 \\
    0 & -2 & 1  & 0 & 1 & -1 \\
    0 & 0  & -1 & 1 & 0 & -2
  \end{bmatrix} \sim
  \begin{bmatrix}
    1 & 1 & 1            & 0  & 0            & 1 \\
    0 & 1 & -\frac{1}{2} & 0  & -\frac{1}{2} & \frac{1}{2} \\
    0 & 0 & 1            & -1 & 0            & 2
  \end{bmatrix} \sim \\
  \begin{bmatrix}
    1 & 1 & 0 & 1            & 0            & -1 \\
    0 & 1 & 0 & -\frac{1}{2} & -\frac{1}{2} & \frac{3}{2} \\
    0 & 0 & 1 & -1           & 0            & 2
  \end{bmatrix} \sim
  \begin{bmatrix}
    1 & 0 & 0 & \frac{3}{2}  & \frac{1}{2}  & -\frac{5}{2} \\
    0 & 1 & 0 & -\frac{1}{2} & -\frac{1}{2} & \frac{3}{2} \\
    0 & 0 & 1 & -1           & 0            & 2
  \end{bmatrix} \\
  \textit{Hence }B^{-1} = 
  \begin{bmatrix}
    \frac{3}{2}  & \frac{1}{2}  & -\frac{5}{2} \\
    -\frac{1}{2} & -\frac{1}{2} & \frac{3}{2} \\
    -1           & 0            & 2
  \end{bmatrix}
\end{align*}

Thus, $[\vec{w}]_B$ can be computed via:
\begin{align*}
  \begin{bmatrix}
    \frac{3}{2}  & \frac{1}{2}  & -\frac{5}{2} \\
    -\frac{1}{2} & -\frac{1}{2} & \frac{3}{2} \\
    -1           & 0            & 2
  \end{bmatrix} \times 
  \begin{bmatrix}
    -5 \\
    8 \\
    -5
  \end{bmatrix} =
  \begin{bmatrix}
    -\frac{15}{2} + 4 + \frac{25}{2} \\
    \frac{5}{2} - 4 - \frac{15}{2} \\
    5 - 10
  \end{bmatrix} = 
  \begin{bmatrix}
    9 \\
    1 \\
    -5
  \end{bmatrix}
\end{align*}

\subsubsection{Answer 15}
\label{sec-1-6-3}
Similarly, $[\vec{w}]_C$ is just $C^{-1}w$ (we've already computed $C^{-1}$
in the previous answer.)
\begin{align*}
  \begin{bmatrix}
    1  & -\frac{1}{2} & \frac{1}{2} \\
    -1 & \frac{1}{2}  & -\frac{1}{2} \\
    1  & 2            & 1
  \end{bmatrix} \times
  \begin{bmatrix}
    -5 \\
    8 \\
    -5
  \end{bmatrix} =
  \begin{bmatrix}
    -5 - 4 - \frac{5}{2} \\
    5  + 4 + \frac{5}{2} \\
    -5 + 16 - 5
  \end{bmatrix} =
  \begin{bmatrix}
    -\frac{23}{2} \\
    \frac{23}{2} \\
    6
  \end{bmatrix}
\end{align*}
% Emacs 25.1.50.2 (Org mode 8.2.10)
\end{document}